In [67]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from config import db_password
from flask import Flask
from flask_sqlalchemy import sqlalchemy
import os
import re
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

path= 'Resources/'

In [68]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/team3"
engine = create_engine(db_string)

In [69]:
obj = pd.read_csv(path+'objects_clean.csv', index_col=0)
obj.head()

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3,5,7,8,9,10,11,13,14,17,18) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

  object_id entity_type parent_id                name    category_code     status  founded_at closed_at country_code state_code         city       region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
0       c:1     Company       NaN            Wetpaint              web  operating  2005-10-17       NaN          USA         WA      Seattle      Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17
1      c:10     Company       NaN             Flektor      games_video   acquired         NaN       NaN          USA         CA  Culver City  Los Angeles                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
2     c:100     Company       NaN               There      games_video   acquired         NaN       NaN          USA         CA    San Mateo       SF Bay                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2003-02-01        2011-09-23           4             12
3   c:10000     Company       NaN             MYWEBBO  network_hosting  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
4   c:10001     Company       NaN  THE Movie Streamer      games_video  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

In [4]:
obj[obj['object_id'].str.contains('p:', regex=True)]

       object_id entity_type parent_id                    name category_code     status founded_at closed_at country_code state_code city   region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
208205      p:10      Person       NaN         Mark Zuckerberg           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2007-01-01        2013-12-04           5              2
208206     p:100      Person       NaN            Peter Lester           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208207    p:1000      Person       NaN  Dr. Steven E. Saunders           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208208   p:10000      Person       NaN              Neil Capel           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
208209  p:100000      Person       NaN              Sue Pilsch           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
...          ...         ...       ...                     ...           ...        ...        ...       ...          ...        ...  ...      ...                 ...                ...                ...                 ...              ...             ...             ...                ...                ...               ...         ...            ...
434908   p:99995      Person       NaN               Sue Gench           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
434909   p:99996      Person       NaN         Rick Tamberrino           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
434910   p:99997      Person       NaN           Peter Lalonde           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              7
434911   p:99998      Person       NaN            Adam Neumann           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              2
434912   p:99999      Person       NaN           Ramon Peypoch           NaN  operating        NaN       NaN          NaN        NaN  NaN  unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

[226708 rows x 24 columns]

In [70]:
ppl = pd.read_csv(path+'people_cleaner.csv', index_col=0)
ppl

       object_id first_name last_name affiliation_name
0            p:2        Ben   Elowitz        Blue Nile
1            p:3      Kevin  Flaherty         Wetpaint
2            p:4       Raju   Vegesna             Zoho
3            p:5        Ian     Wenig             Zoho
4            p:6      Kevin      Rose     i/o Ventures
...          ...        ...       ...              ...
226703  p:268587       Mark   Stolper     Unaffiliated
226704  p:268589       John      Pins     Unaffiliated
226705  p:268590      David  Schulhof     Unaffiliated
226706  p:268592    Matthew  D. Rosen     Unaffiliated
226707  p:268593     Gordon  Hutchins     Unaffiliated

[226708 rows x 4 columns]

In [71]:
ppl.object_id.nunique()

226708

In [192]:
degrees = pd.read_csv(path +'degrees_clean.csv', index_col=0)
degrees

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [193]:
deg = degrees
#deg['degree_type']=[x for x in deg['degree_type'] if str(x) != 'nan']

deg[deg['degree_type']!='NaN']

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [194]:
deg

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [195]:
deg['degree_type'] = deg['degree_type'].fillna(0)
deg

       object_id degree_type                       subject                                        institution graduated_at
0         p:6117         MBA                           NaN                                                NaN          NaN
1         p:6136          BA               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          MS            Mass Communication                                  Boston University     1/1/1992
3         p:6005          MS           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832         BCS  Computer Science, Psychology                                    Rice University          NaN
...          ...         ...                           ...                                                ...          ...
109605  p:268589         CPA                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527     MS & BS                   Engineering               South China University of Technology          NaN
109607  p:268527         PhD                   Engineering                                Clarkson University          NaN
109608  p:268528        B.S.        Electrical Engineering                          Colorado State University          NaN
109609  p:268528        J.D.                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [196]:
deg_values = pd.read_csv(path +'deg_counts.csv', index_col=0)
deg_values = deg_values['degree_type']
deg_values.to_dict()

{'2:01': 0,
 '2:02': 0,
 '1': 0,
 '2.1': 0,
 '2.2': 0,
 '3': 0,
 '4': 0,
 '7': 0,
 '10': 0,
 '360': 0,
 '2004': 0,
 '2008': 0,
 '2013': 0,
 'Sep-45': 0,
 '-': 0,
 '!st Class Honors': 0,
 '"Mini-MBA"': 0,
 '(2Years) UniversityLife': 0,
 "(B.A.J) Bachelor's of Art in Jou": 2,
 '(expected) 2014': 2,
 '(Hons) BSc.': 2,
 '(In Progress)': 0,
 '(incomplete)': 0,
 '(MSc), Finance, General': 3,
 '(PHR) certification': 0,
 '(Syracuse, NY)': 0,
 ', Information Technology': 0,
 '.': 0,
 '.5 MBA': 0,
 '??, ??': 0,
 '???': 0,
 '1 year diploma': 0,
 '1 Year Visiting Student': 0,
 '1. Fed. Exams': 0,
 '1. Staatsexamen': 0,
 '1/2 MBA': 0,
 '1:1 First Class Honors': 0,
 '12th': 0,
 '12th Std': 0,
 "13 A-C GCSE's": 0,
 '1-4 Grade': 1,
 '14N1': 1,
 '18c': 1,
 '1990 to 1993': 1,
 '1st BSc': 2,
 '1st BSc (Hons)': 2,
 '1st Class': 0,
 '1st Class BA Honours Degree': 2,
 '1st Class BA Hons': 2,
 '1st Class BSc Hons': 2,
 '1st Class Honours': 2,
 '1st Class Hons': 0,
 '1st Class Hons Chemical Engineer': 0,
 '1st Class MEng': 0,
 '1-Year Program': 0,
 "2 BSc's": 2,
 '2 year diploma': 0,
 '2 years College': 0,
 '2. Fed. Exams': 0,
 '2. Staatsexamen': 0,
 '2.1 BA Honours': 2,
 '2.1 BA Hons': 2,
 '2.1 Ba Hons': 2,
 '2:1 BA (Hons)': 2,
 '2:1 BA(Hons)': 2,
 '2:1 BSC Hons': 2,
 '2:1 Business': 2,
 '2:1 MEng': 3,
 '2008 MBA': 3,
 '2012-2013': 0,
 '2D Design': 0,
 '2nd class honours': 0,
 '2nd Degree': 2,
 '2nd Upper Class (hons)': 1,
 '2-term exchange': 0,
 '2yr Certification': 0,
 '3 eme cycle Banque et Finance DE': 0,
 '3 years': 0,
 '3 years Polytechnic Diploma': 2,
 '3 yr Diploma': 0,
 '3 yrs in PHD program': 3,
 '3yr diploma': 0,
 '4 A levels': 2,
 '4 year Bachelor of Science': 2,
 '4 year MEng': 3,
 '4th European level': 2,
 '4-year Course': 2,
 '5 year College degree (BSc)': 2,
 '5 Year Degree': 2,
 '5 year degree ( Master )': 3,
 '5 year diploma': 2,
 '5 year dual major Bachelor Degre': 2,
 '5 year Integrated B.Tech/M.Tech': 3,
 "5 year Master's Degree": 3,
 '5 years': 2,
 '5 years degree': 2,
 '5 years Faculty': 0,
 '5 years university degree': 2,
 '5-7 Grade': 0,
 '5-year degree': 2,
 '5-years Diploma': 2,
 '60 HE': 0,
 '6th Year Professional': 2,
 '8-12 Grade': 0,
 '8th Degree': 0,
 'a bachelorÃ‚Â´s degree': 2,
 'A Level': 2,
 'A Levels': 2,
 'A levels': 2,
 "'A' Levels": 2,
 'Â– MBA': 3,
 'A. B. summa cum laude': 2,
 'A.A. & A.S.': 1,
 'A.A. in Accounting and a B.S. in': 1,
 'A.A., General Ed.': 1,
 'A.A.S. Photography Technology': 1,
 'A.B': 2,
 'A.B.': 2,
 'A.B. (Honors)': 2,
 'A.B. and M.D.': 4,
 'A.B. cum laude': 2,
 'A.B. degree': 2,
 'A.B. honors': 2,
 'A.B. Honors': 2,
 'A.B. Magna Cum Laude': 2,
 'A.B. magna cum laude': 2,
 'A.B. or Bachelor of arts': 2,
 'A.B., & B.E': 2,
 'A.B., Biology': 2,
 "A.B., Int'l Relations, Economics": 2,
 'A.B., magna cum laude': 2,
 'A.B., Magna cum laude, Phi Beta ': 2,
 'A.B., Politics': 2,
 'A.I.M. Graduate': 2,
 'A.M': 3,
 'A.M.': 3,
 'A.M.L.S': 3,
 'A.M.R.S.': 3,
 'A.S.': 1,
 'Â“DiplomkauffrauÂ” degree': 1,
 'A+': 1,
 'A1': 1,
 'AA': 1,
 'AA/BS': 2,
 'AAA': 1,
 'AAB': 1,
 'AABIS': 1,
 'AAS': 1,
 'AAS Degree': 1,
 'AAS-Grad': 1,
 'AAUCT': 1,
 'AB': 2,
 'AB (magna cum laude)': 2,
 'AB and BBA': 2,
 'AB cum laude': 2,
 'AB Degree': 2,
 'AB magna cum laude': 2,
 'AB with Honors': 2,
 'AB with Honors and Distinction': 2,
 'AB, Economics': 2,
 'AB, Engineering, Economics': 2,
 'AB, magna cum laude': 2,
 'AB, Magna Cum Laude': 2,
 'AB, US History, CS, Psychology': 2,
 'AB/SM': 3,
 'ABA': 2,
 'ABC Diploma': 2,
 'ABD': 2,
 'Abitur': 2,
 'ABJ': 1,
 'Abogado / Attorney': 4,
 'Abogado, Derecho': 4,
 'AC': 2,
 'ACA': 2,
 'ACA, Accounting': 2,
 'ACA/FCA': 2,
 'Academic': 0,
 'Academic degree': 0,
 'Academic Degree': 0,
 'academic degree with a major in ': 0,
 'academic honors': 0,
 'Academy Economist': 2,
 'ACCA': 2,
 'Accelerated Development Programm': 0,
 'Accelerator': 0,
 'Account Hons.': 0,
 'Accountancy': 0,
 'Accountant': 2,
 'Accounting': 2,
 'accounting': 2,
 'Accounting & Finance': 2,
 'Accounting and Finance': 2,
 'Accounting Certificate': 2,
 'Accounting degree': 2,
 'Accounting Extension': 2,
 'Accounting/Finance': 2,
 'ACCP': 0,
 'ACE': 0,
 'achelor in Engineering, Mechanic': 2,
 'ACLA (Auto Claims Law Associate)': 4,
 'ACMA': 2,
 'ACMA, Chartered Management Accou': 2,
 'ACMI': 2,
 'Acountancy': 2,
 'ACSI': 2,
 'Actuaries': 2,
 'Actuary': 2,
 'AD': 0,
 'Ad Design': 0,
 'additiona': 0,
 'additional': 0,
 'ade': 0,
 'ADE Lic&Master': 0,
 'AdeCaP': 2,
 'ADIM': 2,
 'Adjunct Fellow': 0,
 'Administrador': 0,
 'Administrador de empresas': 2,
 'Administrador de Empresas, EconÃ³': 2,
 'Administration': 0,
 'Administrative Asst': 0,
 'Admission': 0,
 'ADN': 2,
 'ADP 56': 2,
 'ADV Diploma': 2,
 'Advance Diploma in Computer Soft': 2,
 'Advanced Bachelor of Science deg': 2,
 'Advanced Certificate': 1,
 'Advanced Certificate for Executi': 1,
 'Advanced Computer Science': 1,
 'Advanced Degree': 1,
 'Advanced Degrees': 1,
 'advanced degrees': 1,
 'Advanced Diploma': 1,
 'Advanced Diploma in Computer App': 2,
 'Advanced Diploma in Software Eng': 2,
 'Advanced Diploma in Sound': 2,
 'Advanced Executive Education Pro': 2,
 'Advanced Executive Management Pr': 2,
 'Advanced Executive Program': 2,
 'Advanced Graphic Design Diploma': 2,
 'Advanced Industrial Marketing Se': 2,
 'Advanced Management': 2,
 'Advanced Management Certificate': 2,
 'Advanced Management Degree': 2,
 'Advanced Management Program': 2,
 'Advanced Management Programme': 2,
 'Advanced Management Programs': 2,
 "Advanced Master's Degree": 3,
 'Advanced Masters degree in Compu': 3,
 "Advanced Master's Dual Degree": 3,
 'Advanced MBA': 4,
 'Advanced Project Management': 2,
 'Advertising': 1,
 'Advertising, Marketing and Strat': 1,
 'AEA/Stanford Executive Program': 1,
 'AEC': 1,
 'AEMP': 1,
 'Aeronautical engineering': 3,
 'Aeronautical Engineering': 3,
 'Aerospace': 3,
 'Aerospace Engineering': 3,
 'AFA': 2,
 'African Studies, Middle Eastern ': 2,
 'AgriBusiness': 2,
 'Agribusiness Leadership Plus': 2,
 'Agriculture and Veterinary Medic': 2,
 'ahuoora@myopera.com': 0,
 'AI': 0,
 'AICWA': 0,
 'Airway Science': 0,
 'AISSCE': 0,
 'AISSE': 0,
 'AkademiÃ¸konom': 0,
 'A-Level': 2,
 'A-Levels': 2,
 'A-levels': 2,
 'ALM': 3,
 'AM': 3,
 'AM and PhD': 5,
 'Ambassador': 0,
 'AMCT': 0,
 'Amherst, & B.Tech (Honors)': 2,
 'AMIE': 3,
 'AMIE(BE)': 3,
 'AMP': 3,
 'AMP 11': 3,
 'AMP/ISMP': 3,
 'AMP/MBA': 4,
 'AMPM': 3,
 'Analyst': 2,
 'Analyst Developer': 2,
 'Analytics': 2,
 'animation': 0,
 'Anthropology': 2,
 'AOS': 2,
 'AP': 2,
 'APC': 2,
 'APC (MS)': 3,
 'APMP': 3,
 'Appleton, Wisconsin, with Bachel': 0,
 'Application Developer': 2,
 'Applied BSc': 2,
 'Applied Economics': 2,
 'Applied License': 2,
 'Applied Mathematics & Economics': 2,
 'Applied Science': 2,
 'Applied Science (Computer Scienc': 2,
 'Apprenticeship at Robotic': 2,
 'Arabic': 2,
 'Architecte DPLG': 2,
 'architecture': 2,
 'Architecture and Planning': 2,
 'Architetto': 2,
 'Arquitecto Superior': 2,
 'Arquitectura': 2,
 'Array Processing': 2,
 'Art': 2,
 'Art & Design': 2,
 'Art and Engineering': 2,
 'Artium Baccalaureus': 2,
 'Arts': 2,
 'Arts and Sciences': 2,
 'Arts degree': 2,
 'Arts Degree': 2,
 'arts degrees': 2,
 'Arts,': 2,
 'ARU': 2,
 'AS': 1,
 "AS & A Level's": 1,
 'AS, BS, MBA,': 4,
 'ASc': 1,
 'ASC': 1,
 'Asistente al programa, Marketing': 0,
 'ASME': 1,
 'Asoociates of Arts': 1,
 'Ass.Dip.App. Science': 1,
 'Asscociates': 1,
 'Assistant Professor': 3,
 'Assistent Programmer': 2,
 'assoc': 1,
 'Associate': 1,
 'Associate Arts': 1,
 'Associate Arts Degree': 1,
 'Associate Degree': 1,
 'Associate degree': 1,
 'associate degree': 1,
 'Associate Degree (4 years study)': 2,
 'Associate Engineer': 1,
 'Associate Fellow': 1,
 'Associate in Applied Science': 1,
 'Associate in Applied Science Deg': 1,
 'Associate in Arts': 1,
 'Associate in Science': 1,
 'Associate in Science Degree, Gra': 1,
 'Associate of  Arts': 1,
 'Associate of Applied Science': 1,
 'Associate of Applied Sciences': 1,
 'Associate of Art': 1,
 'Associate of Arts': 1,
 'Associate of Arts (A.A.': 1,
 'Associate of Arts (A.A.)': 1,
 'Associate of Arts (AA)': 1,
 'Associate of Arts and Sciences (': 1,
 'Associate of Arts Degree': 1,
 'Associate of Arts, General': 1,
 'Associate of Irish Taxation Inst': 1,
 'Associate of Marketing': 1,
 'Associate of Science': 1,
 'Associate of Science (A.S.': 1,
 'Associate of Science (A.S.)': 1,
 'Associate of Science (AS)': 3,
 'Associate Professor': 1,
 'AssociateÂ’s Degree': 2,
 'Associated Degree': 1,
 'Associates': 1,
 "Associate's degre": 1,
 "Associate's degree": 1,
 'Associates degree & logistics,  ': 1,
 'Associates In Applied Science': 1,
 'Associates in Applied Sciences': 1,
 'Associates in Art': 2,
 'Associates in Arts': 1,
 'Associates in Science': 1,
 'Associates in Specialized Techno': 1,
 'Associates of Applied Science': 1,
 "Associate's of Applied Science": 1,
 'associates of art': 1,
 'Associates of Arts': 1,
 'Associates of Communications': 1,
 'Associates of Science': 1,
 'Associates of Sciences': 1,
 'Associateship': 1,
 'Association of Arts': 1,
 'Assoiates': 1,
 'aster of Business Administration': 4,
 'attended EE': 0,
 'Attorney': 4,
 'Audio Engineering': 2,
 'Audit Controle de Gestion': 2,
 'Aviation, Business & Administrat': 2,
 'Avionics Engineering': 3,
 'B': 2,
 'B - Level': 2,
 'B A, P G Diploma in Journalism': 2,
 'B App Sc (Hons)': 2,
 'B App. Sci, LLB': 2,
 'B Arch': 2,
 'B Com (exchange student)': 2,
 'B Comm (Hons) / LLB (Hons)': 1,
 'B Commerce': 1,
 'B Comp Sci': 1,
 'B Corp Law; LLB': 4,
 'B Ec': 2,
 'B Elec': 2,
 'B Eng Hons, Mechanical Engineeri': 2,
 'B Math': 2,
 'B of A': 2,
 'B of Eng': 2,
 'B Pharm': 2,
 'B Pharmacy, (Hons)': 2,
 'B Sc (MA Sc)': 3,
 'B Sc Economics': 2,
 'B Sc, PCM': 3,
 'B Sc. (Econ), Economics, Account': 2,
 'B Sci': 2,
 'B Science': 2,
 'B Tech': 2,
 'B Tech, EE and CS': 2,
 'B, E. Computer & Science Enginee': 2,
 'B.': 2,
 'B. Admin': 2,
 'B. Arch': 2,
 'B. Arch.': 2,
 'B. Bible': 2,
 'B. Business': 2,
 'B. ChE.': 2,
 'B. Commerce': 2,
 'B. Comp. Sc': 2,
 'B. Des': 2,
 'B. Design': 2,
 'B. Econ': 2,
 'B. Econ.': 2,
 'B. Eng': 2,
 'B. Eng, Electrical Engineering': 2,
 'B. Eng. & Mgt.': 2,
 'B. Eng. 2(ii)': 2,
 'B. Engg': 2,
 'B. Engg.': 2,
 'B. Engineering': 2,
 'B. Engrg': 2,
 'B. Math': 2,
 'B. Math (Hon.)': 2,
 'B. Math (Honors)': 2,
 'B. of Fine Arts': 2,
 'B. Proc': 2,
 'B. Sc. in Engr': 2,
 'B. Sc.with Honors': 2,
 'B. Sci': 2,
 'B. Tech & M. Tech': 3,
 'B. Tech (Hons)': 2,
 'B.A': 2,
 'B.A & P.A': 2,
 'B.A (with Honors)': 2,
 'B.A and M.B.A.': 4,
 'B.A Business Economics': 2,
 'B.A Criminal Justice': 2,
 'B.A MARKETING': 2,
 'B.A Psychology': 2,
 'B.A.': 2,
 'B.A. - High Honors': 2,
 'B.A. - Phi Beta Kappa': 2,
 'B.A. & B.Mus.': 2,
 'B.A. & M.A.': 3,
 'B.A. (Cum Laude)': 2,
 'B.A. (Honors)': 2,
 'B.A. (Hons) - First Class': 2,
 'B.A. (Hons.), English': 2,
 'B.A. (incomplete)': 0,
 'B.A. (Mod), Economics': 2,
 'B.A. (Mod.)': 2,
 'B.A. (Mod.) Comp. Sci.': 2,
 'B.A. (Phi Beta Kappa)': 2,
 'B.A. (summa cum laude)': 2,
 'B.A. (Summa Cum Laude)': 2,
 'B.A. (summa cum laude, Phi Beta ': 2,
 'B.A. , Graduate Cum Laude': 2,
 'B.A. , Summa Cum Laude': 2,
 'B.A. / A.A.': 2,
 'B.A. / B.S., Finance / Molecular': 2,
 'B.A. / M.A.': 3,
 'B.A. Accounting': 2,
 'B.A. and an M.S.': 3,
 'B.A. and Certificate': 2,
 'B.A. and J.D': 4,
 'B.A. and J.D. degrees': 4,
 'B.A. and M.A': 3,
 'B.A. and M.A.': 3,
 'B.A. and M.D': 4,
 'B.A. and M.D.': 4,
 'B.A. and Ph.D.': 5,
 'B.A. Arts': 2,
 'B.A. Business': 2,
 'B.A. Business Administration': 2,
 'B.A. Business Administration, Ma': 2,
 'B.A. cum laude': 2,
 'B.A. Cum Laude': 2,
 'B.A. degree': 2,
 'B.A. degree and an M.A. degree': 3,
 'B.A. Double Major': 2,
 'B.A. Eauivilant': 2,
 'B.A. Equivilant': 2,
 'B.A. Honours': 2,
 'B.A. Honours, first class averag': 2,
 'B.A. Hons (Distinction) & M.A.': 2,
 'B.A. Humanities': 2,
 'B.A. in economics': 2,
 'B.A. in Economics': 2,
 'B.A. in French': 2,
 'B.A. International Relations': 2,
 'B.A. International Relations (Gl': 2,
 'B.A. Joint Honours': 2,
 'B.A. Journalism': 2,
 'B.A. Magna Cum Laude': 2,
 'B.A. Magna Cum Laude, Phi Beta K': 2,
 'B.A. Mass Communications': 2,
 'B.A. Mass Communications/ Market': 2,
 'B.A. Phil.': 2,
 'B.A. Political Science and Telec': 2,
 'B.A. with honors': 2,
 'B.A. with Honors': 2,
 'B.A. With Honors': 2,
 'B.A. with honors in History': 2,
 'B.A. With Honours': 2,
 'B.A.(Honors)': 2,
 'B.A.,': 2,
 'B.A., American Studies, History': 2,
 'B.A., B.A.': 2,
 'B.A., B.Ed., MSc. Ed.': 3,
 'B.A., B.S.': 2,
 'B.A., biological psychology': 2,
 'B.A., Biology and Anthropology': 2,
 'B.A., Business': 2,
 'B.A., Chemistry': 2,
 'B.A., Columbia College': 2,
 'B.A., Economics': 2,
 'B.A., English': 2,
 'B.A., History': 2,
 'B.A., History, Political Science': 2,
 'B.A., LL.B (Hons.) graduate': 4,
 'B.A., M.S.': 3,
 'B.A., magna cum laude': 2,
 'B.A., Magna Cum Laude': 2,
 'B.A., Philosophy': 2,
 'B.A., Political Science': 2,
 'B.A., summa cum laude': 2,
 'B.A., Summa Cum Laude': 2,
 'B.A./ L.L.B': 4,
 'B.A./M.A.': 3,
 'B.A.C.S.': 2,
 'B.A.E.': 2,
 'B.A.H': 2,
 'B.A.H.': 2,
 'B.A.HSG': 2,
 'B.A.I / B.A.': 2,
 'B.A.I.S.': 2,
 'B.A.LLB (Hons.)': 4,
 'B.A.S Supervision and Management': 2,
 'B.A.S. summa cum laude': 2,
 'B.A.Sc.': 2,
 'B.A>': 2,
 'B.App.Sc (Mathematics)': 2,
 'B.Arch': 2,
 'B.Arch.': 2,
 'B.Arts': 2,
 'B.B.A / B.A': 2,
 'B.B.A with Honours, Finance': 2,
 'B.B.A.': 2,
 'B.B.A. and a M.B.A.': 4,
 'B.B.A. with honors': 2,
 'B.B.A., Finance International Bu': 2,
 'B.B.S': 2,
 'B.B.S.': 2,
 'B.Bus': 2,
 'B.Bus (Marketing)': 2,
 'B.Business': 2,
 'B.C.': 2,
 'B.C.A': 2,
 'B.C.E.': 2,
 'B.C.L./L.L.B., Law': 4,
 'B.Cert.': 2,
 'B.Ch.E': 2,
 'B.Chem': 2,
 'B.Com': 2,
 'B.Com (Computers)': 2,
 'B.Com (Hons)': 2,
 'B.Com (Hons.)': 2,
 'B.Com / GDA': 2,
 'B.Com Accounting': 2,
 'B.Com Accounting Hons': 2,
 'B.Com Honours': 2,
 'B.Com, DCM': 2,
 'B.Com/BMOS,': 2,
 'B.Comm': 2,
 'B.Comm and B.Ec': 2,
 'B.Comm General': 2,
 'B.Comm with honors': 2,
 'B.Comm. Marketing': 2,
 'B.Comm/B.A': 2,
 'B.Commerce': 2,
 'B.Comp': 2,
 'B.Compt': 2,
 'B.Compt (Hons), CTA': 2,
 'B.CS., Bachelor of Computer Scie': 2,
 'B.Des': 2,
 'B.Design': 2,
 'B.E': 2,
 'B.E - Bachelors': 2,
 'B.E ( IT)': 2,
 'B.E (Hons)': 2,
 'B.E (Hons.)': 2,
 'B.E Computer Engg': 2,
 'B.E Computer Engineering': 2,
 'B.E in Computers': 2,
 'B.E(Bachelor in Engineering )': 2,
 'B.E(Hons)': 2,
 'B.E(IT)': 2,
 'B.E.': 2,
 'B.E. (Electronics)': 2,
 'B.E. (Graduation)': 2,
 'B.E. (hons)': 2,
 'B.E. (Hons.)': 2,
 'B.E. and M.Sc. Dual Degree': 2,
 'B.E.(Hons)': 2,
 'B.E.(Hons.)': 2,
 'B.E., B.A': 2,
 'B.E., Computers': 2,
 'B.E., Electronics Engg.': 2,
 'B.E.Civil Engineering': 2,
 'B.E.D': 2,
 'B.E.E.': 2,
 'B.E.S.c': 2,
 'B.E.Sc': 2,
 'B.E/B/Tech': 2,
 'B.E/B-Tech': 2,
 'B.Econ': 2,
 'B.Econ.': 2,
 'B.Ed': 2,
 'B.ed': 2,
 'B.Ed,': 2,
 'B.Ed.': 2,
 'B.ed.': 2,
 'B.Eng (Hons I)': 2,
 'B.Eng (Hons) - 1st': 2,
 'B.Eng. (Honors)': 2,
 'B.Eng. Minor in Business marketi': 2,
 'B.Eng/Mgmt': 2,
 'B.Engg': 2,
 'B.Engineering': 2,
 'B.G.S': 2,
 'B.G.S.': 2,
 'B.H.K.': 2,
 'B.I.E.': 2,
 'B.I.E.; Ph.D': 5,
 'B.I.S': 2,
 'B.ICT': 2,
 'B.J.': 2,
 'B.L': 2,
 'B.Litt': 2,
 'B.M.': 2,
 'B.M.S': 2,
 'B.Math': 2,
 'B.Math. in Honours Computer Scie': 2,
 'B.mus': 2,
 'B.Mus.': 2,
 'B.P.S.': 2,
 'B.Ph.': 2,
 'B.Pharm.': 2,
 'B.Pharma': 2,
 'B.Pharmacy': 2,
 'b.pharmacy': 2,
 'B.pharmacy(full time)': 2,
 'B.Phil': 2,
 'B.Phil.': 2,
 'B.Phill': 2,
 'B.S': 2,
 'B.S & M.S': 3,
 'B.S (Hons)': 2,
 'B.S Engineering': 2,
 'B.S Mass Communications': 2,
 'B.S, Business and Finance': 2,
 'B.S, M.S': 3,
 'B.S.': 2,
 'B.S. & A.B.': 2,
 'B.S. & B.A.': 2,
 'B.S. & M.A.': 3,
 'B.S. & M.Acc': 3,
 'B.S. & MBA': 4,
 'B.S. (Engineering)': 2,
 'B.S. (High Honors)': 2,
 'B.S. (Honors)': 2,
 'B.S. (Hons)': 2,
 'B.S. (inc)': 2,
 'B.S. (with hons)': 2,
 'B.S. , M.S.': 3,
 'B.S. / B.A.': 2,
 'B.S. / EECS': 2,
 'B.S. / M.S': 3,
 'B.S. / M.S.': 3,
 'B.S. / M.S.E.': 3,
 'B.S. A.A.E.': 2,
 'B.S. Accounting': 2,
 'B.S. and B.A': 2,
 'B.S. and M.A.': 3,
 'B.S. and M.B.A.': 4,
 'B.S. Business': 2,
 'B.S. Business Administration': 2,
 'B.S. Business Administration (Fi': 2,
 'B.S. CIS': 2,
 'B.S. Commerce': 2,
 'B.S. Communications': 2,
 'B.S. Computer Engineering': 2,
 'B.S. Computer Information System': 2,
 'B.S. Computer Science': 2,
 'B.S. Computer Science and Engine': 2,
 'B.S. cum laude': 2,
 'B.S. degree': 2,
 'B.S. Degree, Cum Laude': 2,
 'B.S. Double Major, Electrical En': 2,
 'B.S. Econ': 2,
 'B.S. Economics': 2,
 'B.S. Electrical & Computer Engin': 2,
 'B.S. Electrical Engineering': 2,
 'B.S. Electronics & Telecommunica': 2,
 'B.S. Engineering': 2,
 'B.S. honors': 2,
 'B.S. Honours': 2,
 'B.S. in Business': 2,
 'B.S. in Business Administration': 2,
 'B.S. in business administration': 2,
 'B.S. in Computer Engineering': 2,
 'B.S. in Computer Science': 2,
 'B.S. in Economics': 2,
 'B.S. in Electrical Engineering': 2,
 'B.S. in Engineering': 2,
 'B.S. in Management (Honors)': 2,
 'B.S. in mechanical engineering': 2,
 'B.S. in Neuroscience': 2,
 'B.S. in Pharmacy': 2,
 'B.S. in Systems and Sciences, Co': 2,
 'B.S. International Political Eco': 2,
 'B.S. M.E.': 2,
 'B.S. M.S.': 2,
 'B.S. Management': 2,
 'B.S. Marketing': 2,
 'B.S. Mechanical Engineering': 2,
 'B.S. Physical Science': 2,
 'B.S. Physics': 2,
 'B.S. Psychology': 2,
 'B.S. summa cum laude': 2,
 'B.S. with Distinction': 2,
 'B.S. with Finance Applications &': 2,
 'B.S. with Honors': 2,
 'B.S. With Honors': 2,
 'B.S. with Honors and Distinction': 2,
 'B.S.(summa cum laude)': 2,
 'B.S., Accounting': 2,
 'B.S., B.S., B.A.': 2,
 'B.S., Business': 2,
 'B.S., Business Administration': 2,
 'B.S., Computer Science': 2,
 'B.S., Computer Science & Electri': 2,
 'B.S., Computer Science and Busin': 2,
 'B.S., Economics Minor': 2,
 'B.S., Electrical Engineering': 2,
 'B.S., Engineering': 2,
 'B.S., Engineering and Biology': 2,
 'B.S., Finance': 2,
 'B.S., Honors': 2,
 'B.S., Industrial Engineering': 2,
 'B.S., M.Eng': 2,
 'B.S., M.Eng, Ph.D.': 5,
 'B.S., M.Eng.': 3,
 'B.S., M.S.': 3,
 'B.S., M.S. and Ph.D': 5,
 'B.S., M.S., and Ph.D.': 5,
 'B.S., Management': 2,
 'B.S., Management Science and Eng': 2,
 'B.S./ B.A.': 2,
 'B.S./B.A.': 2,
 'B.S./B.FA': 2,
 'B.S./M.S.': 2,
 'B.S./Minor': 2,
 'B.S.B.': 2,
 'B.S.B.A. Finance': 2,
 'B.S.B.A. Pending': 2,
 'B.S.B.S': 2,
 'B.S.C. Photo-Journalism, Radio T': 2,
 'B.S.E': 2,
 'B.S.E.': 2,
 'B.S.E. (cum laude)': 2,
 'B.S.E.E': 2,
 'B.S.E.E., M.S.E.E. and Ph.D.': 5,
 'B.S.Ed.': 2,
 'B.S.Eng.': 1,
 'B.S.F.S': 1,
 'B.S.F.S.': 2,
 'B.S.L': 2,
 'B.S.M.': 2,
 'B.S.M.E': 2,
 'B.S.M.E.': 2,
 'B.S.S.V.E with distinction': 2,
 'B.S.W.': 2,
 'B.S; Awarded B.S': 2,
 'B.S>': 2,
 'B.Sc': 2,
 'B.Sc (Econ)': 2,
 'B.Sc (Honours)': 2,
 'B.Sc (summa cum laude)': 2,
 'B.Sc and M.Sc': 3,
 'B.Sc and Masters Degree': 3,
 'B.Sc Applied Science': 2,
 'B.Sc Computer Science': 2,
 'B.Sc EE': 2,
 'B.Sc Enggenering': 2,
 'B.Sc in view': 2,
 'B.Sc Physics': 2,
 'B.Sc, International program supp': 2,
 'B.Sc.': 2,
 'B.Sc. (Cum Laude)': 2,
 'B.Sc. (Economics)': 2,
 'B.Sc. (Honours)': 2,
 'B.Sc. (Hons), Chemistry': 2,
 'B.Sc. (Ma)': 2,
 'B.Sc. 2:1': 2,
 'B.Sc. and M.Sc.': 3,
 'B.Sc. Computer Science': 2,
 'B.sc. Diploma of Engineer': 2,
 'B.Sc. Ec.': 2,
 'B.Sc. Honours': 2,
 'B.Sc. in Electrical Engineering': 2,
 'B.Sc. in Physics': 2,
 'B.Sc. Summa Cum Laude': 2,
 'B.Sc. with INSTRUMENTATION': 2,
 'B.Sc.(First Class Hons)': 2,
 'B.Sc.(I.T.)': 2,
 'B.Sc., Business Administration &': 2,
 'B.Sc., Economics': 2,
 'B.Sc., Engineering': 2,
 'B.Sc., M.Mgmnt': 3,
 'B.Sc.; M.Sc': 3,
 'B.Sc.E': 2,
 'B.Sc.E.E. (Hons.)': 2,
 'B.Sc.IT': 2,
 'B.Sc.IT (Hons)': 2,
 'B.Sc.T.E': 2,
 'B.Sc/Electronics': 2,
 'B.Sci.': 2,
 'B.Soc.Sc': 1,
 'B.Soc.Sci': 2,
 'B.Stat': 2,
 'B.Tech': 2,
 'B.tech': 2,
 'B.Tech (Hons)': 2,
 'B.Tech (Hons.)': 2,
 'B.Tech (IT)': 2,
 'B.Tech degree': 2,
 'B.Tech Full Time': 2,
 'B.TECH(I.T)': 2,
 'B.Tech, Computer science': 2,
 'B.Tech, Electrical Engineering': 2,

In [197]:
deg.degree_type = [deg_values.get(item)
        for item in deg.degree_type
]
deg

       object_id  degree_type                       subject                                        institution graduated_at
0         p:6117          4.0                           NaN                                                NaN          NaN
1         p:6136          2.0               English, French                   Washington University, St. Louis     1/1/1990
2         p:6136          3.0            Mass Communication                                  Boston University     1/1/1992
3         p:6005          3.0           Internet Technology                            University of Greenwich     1/1/2006
4         p:5832          2.0  Computer Science, Psychology                                    Rice University          NaN
...          ...          ...                           ...                                                ...          ...
109605  p:268589          3.0                           NaN  American Institute of Certtified Public Accoun...          NaN
109606  p:268527          3.0                   Engineering               South China University of Technology          NaN
109607  p:268527          5.0                   Engineering                                Clarkson University          NaN
109608  p:268528          2.0        Electrical Engineering                          Colorado State University          NaN
109609  p:268528          3.0                           NaN              University of San Diego School of Law          NaN

[109056 rows x 5 columns]

In [41]:
#counts = degrees.degree_type.value_counts()
#counts_df = pd.DataFrame(counts)
#counts_df.to_csv('deg_counts.csv')

In [200]:
# Getting highest degree, post degree valuation.
deg_test = deg.groupby(deg['object_id']).max()
deg_test = deg_test.reset_index()
deg_test

      object_id  degree_type                            subject                           institution graduated_at
0          p:10          0.0                   Computer Science                    Harvard University         None
1      p:100006          4.0               Strategy & Marketing        MIT Sloan School of Management     1/1/2004
2      p:100013          4.0                 Physical Chemistry                  University of Mumbai         None
3      p:100018          4.0                  Marketing, French  University of Maryland, College Park     1/1/2004
4      p:100031          2.0  Information Science & Engineering         Gogte Institute of Technology     1/1/2010
...         ...          ...                                ...                                   ...          ...
68066   p:99983          0.0                                NaN              University of Washington          NaN
68067   p:99988          2.0         Maths and Computer Science                    Bristol University     1/1/2004
68068   p:99990          2.0                               None                              Technion     1/1/1971
68069   p:99994          2.0                                 MS           University of Madras, India         None
68070   p:99997          3.0                          Economics                  University of Ottawa     1/1/1993

[68071 rows x 5 columns]

In [201]:
deg_test[deg_test['object_id']=='p:6136']

      object_id  degree_type             subject                       institution graduated_at
59154    p:6136          3.0  Mass Communication  Washington University, St. Louis     1/1/1992

In [202]:
deg_test.degree_type.isnull().value_counts()

False    67740
True       331
Name: degree_type, dtype: int64

In [203]:
deg_test.degree_type = deg_test.degree_type.fillna(0)

In [204]:
deg_test.degree_type.isnull().value_counts()

False    68071
Name: degree_type, dtype: int64

In [205]:
deg_test

      object_id  degree_type                            subject                           institution graduated_at
0          p:10          0.0                   Computer Science                    Harvard University         None
1      p:100006          4.0               Strategy & Marketing        MIT Sloan School of Management     1/1/2004
2      p:100013          4.0                 Physical Chemistry                  University of Mumbai         None
3      p:100018          4.0                  Marketing, French  University of Maryland, College Park     1/1/2004
4      p:100031          2.0  Information Science & Engineering         Gogte Institute of Technology     1/1/2010
...         ...          ...                                ...                                   ...          ...
68066   p:99983          0.0                                NaN              University of Washington          NaN
68067   p:99988          2.0         Maths and Computer Science                    Bristol University     1/1/2004
68068   p:99990          2.0                               None                              Technion     1/1/1971
68069   p:99994          2.0                                 MS           University of Madras, India         None
68070   p:99997          3.0                          Economics                  University of Ottawa     1/1/1993

[68071 rows x 5 columns]

In [206]:
deg_test[deg_test['object_id']=='p:6']

      object_id  degree_type subject                      institution graduated_at
58844       p:6          0.0     NaN  University of Nevada, Las Vegas          NaN

In [164]:
deg_test.degree_type.isnull().value_counts()

False    68071
Name: degree_type, dtype: int64

In [207]:
missing_degs = deg_test[deg_test['degree_type']==0]
missing_degs

      object_id  degree_type                                            subject                                    institution graduated_at
0          p:10          0.0                                   Computer Science                             Harvard University         None
9      p:100051          0.0                                               None                                Duke University     1/1/2003
26     p:100123          0.0                      Telecommunication Engineering                Università degli Studi di Pavia     1/1/2003
34     p:100137          0.0                                  Civil Engineering    South Dakota School of Mines and Technology     1/1/1994
39     p:100163          0.0                                               None  Indiana University, Kelley School of Business         None
...         ...          ...                                                ...                                            ...          ...
68011   p:99665          0.0                                     Administration                             Dankook University     1/1/1983
68031   p:99745          0.0               Asian Studies and Spanish Literature                             Cornell University     1/1/1994
68036   p:99801          0.0                                        Mathematics               Middle East Technical University         None
68041   p:99841          0.0  Internetional Business Administration and Mode...                     Copenhagen Business School     1/1/2007
68066   p:99983          0.0                                                NaN                       University of Washington          NaN

[6251 rows x 5 columns]

In [208]:
missing_degs.institution.isnull().value_counts()

False    6247
True        4
Name: institution, dtype: int64

In [215]:
#Filtering out persons not graduated from college
missing_degs2 = missing_degs[missing_degs['graduated_at'].notnull()]
not_missing = missing_degs[missing_degs['graduated_at'].isnull()]
print(missing_degs.shape)
print(missing_degs2.shape)
print(not_missing.shape)

(6251, 5)
(2565, 5)
(3686, 5)

In [216]:
#replacing 0 degree types with minimum of 2 for bachelors.
missing_degs2['degree_type'] = missing_degs2['degree_type'].replace(0,2)
missing_degs2

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

      object_id  degree_type                                            subject                                        institution graduated_at
9      p:100051          2.0                                               None                                    Duke University     1/1/2003
26     p:100123          2.0                      Telecommunication Engineering                    Università degli Studi di Pavia     1/1/2003
34     p:100137          2.0                                  Civil Engineering        South Dakota School of Mines and Technology     1/1/1994
84     p:100324          2.0                                            English                                    Whitman College     1/1/1993
95     p:100374          2.0                                               None                 University of California, Berkeley     1/1/1999
...         ...          ...                                                ...                                                ...          ...
67970   p:99477          2.0                                Banking and Finance                          Universidad Metropolitana     1/1/2008
67979   p:99494          2.0                                               None  University of Florida - Warrington College Of ...     1/1/2007
68011   p:99665          2.0                                     Administration                                 Dankook University     1/1/1983
68031   p:99745          2.0               Asian Studies and Spanish Literature                                 Cornell University     1/1/1994
68041   p:99841          2.0  Internetional Business Administration and Mode...                         Copenhagen Business School     1/1/2007

[2565 rows x 5 columns]

In [217]:
frames = [missing_degs2, not_missing]
deg_final = pd.concat(frames)
deg_final = deg_final.sort_index()
print(deg_final.head(20))

    object_id  degree_type                        subject                                    institution graduated_at
0        p:10          0.0               Computer Science                             Harvard University         None
9    p:100051          2.0                           None                                Duke University     1/1/2003
26   p:100123          2.0  Telecommunication Engineering                Università degli Studi di Pavia     1/1/2003
34   p:100137          2.0              Civil Engineering    South Dakota School of Mines and Technology     1/1/1994
39   p:100163          0.0                           None  Indiana University, Kelley School of Business         None
44   p:100178          0.0                       Robotics                Warsaw University of Technology         None
67   p:100276          0.0         mechanical engineering                Florida Institute of Technology         None
84   p:100324          2.0                        English                                Whitman College     1/1/1993
95   p:100374          2.0                           None             University of California, Berkeley     1/1/1999
147  p:100586          0.0                        Finance                  Pennsylvania State University         None
153  p:100619          2.0                           None                        George Mason University     1/1/2005
171  p:100679          2.0                           None                            Columbia University     1/1/2000
179  p:100715          0.0                           None                            Uniban - University         None
183   p:10073          0.0                           None                           Princeton University         None
190  p:100809          2.0              Civil Engineering                       Universidad de los Andes     1/1/2007
197  p:100860          2.0                           None                       University of Notre Dame     1/1/1997
236  p:101047          2.0                           None                              Boston University     1/1/1992
250  p:101169          0.0          Finance and economics                         Long Island University         None
267  p:101224          2.0                           None                University of Missouri-Columbia     1/1/2006
269  p:101234          0.0                           None              University of California Berkeley         None

In [182]:
deg_test = deg_final.groupby(deg_final['object_id']).max()
deg_final2 = deg_test.reset_index()
deg_final2

      object_id  degree_type                            subject                           institution graduated_at
0          p:10          2.0                   Computer Science                    Harvard University          NaN
1      p:100006          4.0               Strategy & Marketing        MIT Sloan School of Management     1/1/2004
2      p:100013          4.0                 Physical Chemistry                  University of Mumbai          NaN
3      p:100018          4.0                  Marketing, French  University of Maryland, College Park     1/1/2004
4      p:100031          2.0  Information Science & Engineering         Gogte Institute of Technology     1/1/2010
...         ...          ...                                ...                                   ...          ...
68066   p:99983          2.0                                NaN              University of Washington          NaN
68067   p:99988          2.0         Maths and Computer Science                    Bristol University     1/1/2004
68068   p:99990          2.0                                NaN                              Technion     1/1/1971
68069   p:99994          2.0                                 MS           University of Madras, India          NaN
68070   p:99997          3.0                          Economics                  University of Ottawa     1/1/1993

[68071 rows x 5 columns]

In [218]:
ppl_deg = ppl.merge(deg_final2, how = 'inner', on='object_id')
ppl_deg

      object_id first_name  last_name affiliation_name  degree_type                                            subject                                        institution graduated_at
0           p:2        Ben    Elowitz        Blue Nile          2.0            Electrical Engineering/Computer Science                 University of California, Berkeley     1/1/1994
1           p:3      Kevin   Flaherty         Wetpaint          4.0                                                NaN                  Washington University in St Louis          NaN
2           p:5        Ian      Wenig             Zoho          2.0                                Biology, Psychology                                    The Aji Network     1/1/2005
3           p:6      Kevin       Rose     i/o Ventures          2.0                                                NaN                    University of Nevada, Las Vegas          NaN
4           p:7        Jay    Adelson             Digg          2.0  Film and Broadcasting, Computer Science Concen...                                  Boston University     1/1/1992
...         ...        ...        ...              ...          ...                                                ...                                                ...          ...
68066  p:268524      James    Trueman     Unaffiliated          3.0                                                NaN  Wharton School of Business , University of Pen...          NaN
68067  p:268527      Harry        Wei     Unaffiliated          5.0                                        Engineering               South China University of Technology          NaN
68068  p:268528     Edward  J. Treska     Unaffiliated          3.0                                                NaN              University of San Diego School of Law          NaN
68069  p:268560       Drew    Langloh     Unaffiliated          4.0                                                NaN                                 Samford University     1/1/2008
68070  p:268589       John       Pins     Unaffiliated          3.0                                                NaN                              Iowa State University          NaN

[68071 rows x 8 columns]

In [232]:
ppl_deg.rename(columns={'object_id':'person_object_id'}, inplace=True)
ppl_deg

      person_object_id first_name  last_name affiliation_name  degree_type                                            subject                                        institution graduated_at
0                  p:2        Ben    Elowitz        Blue Nile          2.0            Electrical Engineering/Computer Science                 University of California, Berkeley     1/1/1994
1                  p:3      Kevin   Flaherty         Wetpaint          4.0                                                NaN                  Washington University in St Louis          NaN
2                  p:5        Ian      Wenig             Zoho          2.0                                Biology, Psychology                                    The Aji Network     1/1/2005
3                  p:6      Kevin       Rose     i/o Ventures          2.0                                                NaN                    University of Nevada, Las Vegas          NaN
4                  p:7        Jay    Adelson             Digg          2.0  Film and Broadcasting, Computer Science Concen...                                  Boston University     1/1/1992
...                ...        ...        ...              ...          ...                                                ...                                                ...          ...
68066         p:268524      James    Trueman     Unaffiliated          3.0                                                NaN  Wharton School of Business , University of Pen...          NaN
68067         p:268527      Harry        Wei     Unaffiliated          5.0                                        Engineering               South China University of Technology          NaN
68068         p:268528     Edward  J. Treska     Unaffiliated          3.0                                                NaN              University of San Diego School of Law          NaN
68069         p:268560       Drew    Langloh     Unaffiliated          4.0                                                NaN                                 Samford University     1/1/2008
68070         p:268589       John       Pins     Unaffiliated          3.0                                                NaN                              Iowa State University          NaN

[68071 rows x 8 columns]

In [233]:
rel = pd.read_csv(path+'relationships_clean.csv', index_col=0)
rel.head()

  person_object_id relationship_object_id                                title
0              p:2                    c:1    Co-Founder/CEO/Board of Directors
1              p:3                    c:1                         VP Marketing
2              p:4                    c:3                           Evangelist
3              p:5                    c:3  Senior Director Strategic Alliances
4              p:7                    c:4              Chief Executive Officer

In [234]:
pdr = rel.merge(ppl_deg, how = 'inner', on='person_object_id')
pdr

       person_object_id relationship_object_id                                              title first_name    last_name affiliation_name  degree_type                                  subject                         institution graduated_at
0                   p:2                    c:1                  Co-Founder/CEO/Board of Directors        Ben      Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science  University of California, Berkeley     1/1/1994
1                   p:2                 c:4993                                    Co-founder & VP        Ben      Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science  University of California, Berkeley     1/1/1994
2                   p:2               c:233024                               Business Development        Ben      Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science  University of California, Berkeley     1/1/1994
3                   p:2                 f:1017                                    Limited Partner        Ben      Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science  University of California, Berkeley     1/1/1994
4                   p:2                c:18661                                         Consultant        Ben      Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science  University of California, Berkeley     1/1/1994
...                 ...                    ...                                                ...        ...          ...              ...          ...                                      ...                                 ...          ...
228578         p:158143                 c:1916  Sr. Product/Service Management positions - GE ...     Arvind  Subramanian     Unaffiliated          4.0                                      NaN     Case Western Reserve University          NaN
228579         p:268589                c:12612                   VP, Finance & Clinical Solutions       John         Pins     Unaffiliated          3.0                                      NaN               Iowa State University          NaN
228580         p:268589                c:12612         Accounting Manager for Facts & Comparisons       John         Pins     Unaffiliated          3.0                                      NaN               Iowa State University          NaN
228581         p:268589                c:12612                  Controller, Wolters Kluwer Health       John         Pins     Unaffiliated          3.0                                      NaN               Iowa State University          NaN
228582         p:268589                c:12612  Director, Accounting - Professional & Educatio...       John         Pins     Unaffiliated          3.0                                      NaN               Iowa State University          NaN

[228583 rows x 10 columns]

In [235]:
companies=obj[obj['object_id'].str.contains('c:|f:', regex=True)]
companies.head()

  object_id entity_type parent_id                name    category_code     status  founded_at closed_at country_code state_code         city       region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
0       c:1     Company       NaN            Wetpaint              web  operating  2005-10-17       NaN          USA         WA      Seattle      Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17
1      c:10     Company       NaN             Flektor      games_video   acquired         NaN       NaN          USA         CA  Culver City  Los Angeles                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
2     c:100     Company       NaN               There      games_video   acquired         NaN       NaN          USA         CA    San Mateo       SF Bay                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2003-02-01        2011-09-23           4             12
3   c:10000     Company       NaN             MYWEBBO  network_hosting  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
4   c:10001     Company       NaN  THE Movie Streamer      games_video  operating  2008-07-26       NaN          NaN        NaN          NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0

In [236]:
companies.rename(columns={'object_id':'relationship_object_id'}, inplace=True)
companies

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\pandas\core\frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

       relationship_object_id   entity_type parent_id                   name    category_code     status  founded_at closed_at country_code state_code             city       region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships
0                         c:1       Company       NaN               Wetpaint              web  operating  2005-10-17       NaN          USA         WA          Seattle      Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17
1                        c:10       Company       NaN                Flektor      games_video   acquired         NaN       NaN          USA         CA      Culver City  Los Angeles                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              6
2                       c:100       Company       NaN                  There      games_video   acquired         NaN       NaN          USA         CA        San Mateo       SF Bay                 NaN                NaN                  0                   0              NaN             NaN               0                0.0         2003-02-01        2011-09-23           4             12
3                     c:10000       Company       NaN                MYWEBBO  network_hosting  operating  2008-07-26       NaN          NaN        NaN              NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
4                     c:10001       Company       NaN     THE Movie Streamer      games_video  operating  2008-07-26       NaN          NaN        NaN              NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              0
...                       ...           ...       ...                    ...              ...        ...         ...       ...          ...        ...              ...          ...                 ...                ...                ...                 ...              ...             ...             ...                ...                ...               ...         ...            ...
208200                 f:9995  FinancialOrg       NaN                TxtLoan              NaN  operating  2008-01-01       NaN          GBR        NaN           London       London                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208201                 f:9996  FinancialOrg       NaN      founder's Capital              NaN  operating         NaN       NaN          NaN        NaN              NaN      unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1
208202                 f:9997  FinancialOrg       NaN           Axel Johnson              NaN  operating  1920-01-01       NaN          USA         NY         New York     New York          2012-10-24         2012-10-24                  1                   1              NaN             NaN               0                0.0                NaN               NaN           0              0
208203                 f:9998  FinancialOrg       NaN  Liberty City Ventures              NaN  operating  2012-07-01       NaN          USA         NY         New York     New York          2012-06-01         2013-11-11                  5                   5              NaN             NaN               0                0.0                NaN               NaN           0              0
208204                 f:9999  FinancialOrg       NaN                CalSTRS              NaN  operating  1913-07-01       NaN          USA         CA  West Sacramento   Sacramento          2012-10-24         2012-10-24                  1                   1              NaN             NaN               0                0.0                NaN               NaN           0              1

[208205 rows x 24 columns]

In [238]:
pdrc = companies.merge(pdr, how = 'inner', on='relationship_object_id')
pdrc

       relationship_object_id   entity_type parent_id              name category_code     status  founded_at closed_at country_code state_code             city      region first_investment_at last_investment_at  investment_rounds  invested_companies first_funding_at last_funding_at  funding_rounds  funding_total_usd first_milestone_at last_milestone_at  milestones  relationships person_object_id                              title first_name   last_name affiliation_name  degree_type                                  subject                                        institution graduated_at
0                         c:1       Company       NaN          Wetpaint           web  operating  2005-10-17       NaN          USA         WA          Seattle     Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17              p:2  Co-Founder/CEO/Board of Directors        Ben     Elowitz        Blue Nile          2.0  Electrical Engineering/Computer Science                 University of California, Berkeley     1/1/1994
1                         c:1       Company       NaN          Wetpaint           web  operating  2005-10-17       NaN          USA         WA          Seattle     Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17              p:3                       VP Marketing      Kevin    Flaherty         Wetpaint          4.0                                      NaN                  Washington University in St Louis          NaN
2                         c:1       Company       NaN          Wetpaint           web  operating  2005-10-17       NaN          USA         WA          Seattle     Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17             p:29                       Board Member        Gus         Tai       BillShrink          4.0                                      NaN  Massachusetts Institute of Technology (MIT), S...          NaN
3                         c:1       Company       NaN          Wetpaint           web  operating  2005-10-17       NaN          USA         WA          Seattle     Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17          p:10132                              Board        Len      Jordan     Unaffiliated          2.0                    Finance and Economics                                 University of Utah     1/1/1987
4                         c:1       Company       NaN          Wetpaint           web  operating  2005-10-17       NaN          USA         WA          Seattle     Seattle                 NaN                NaN                  0                   0       2005-10-01      2008-05-19               3         39750000.0         2010-09-05        2013-09-18           5             17           p:7235                              Board   Theresia    Ranzetta        ForeScout          4.0                                      NaN                                Stanford University          NaN
...                       ...           ...       ...               ...           ...        ...         ...       ...          ...        ...              ...         ...                 ...                ...                ...                 ...              ...             ...             ...                ...                ...               ...         ...            ...              ...                                ...        ...         ...              ...          ...                                      ...                                                ...          ...
227497                  f:999  FinancialOrg       NaN  Neuhaus Partners           NaN  operating  1998-01-01       NaN          DEU        NaN          Hamburg     Hamburg          2007-03-01         2011-11-01                 15                  12              NaN             NaN               0                0.0                NaN               NaN           0              7         p:255376            Chief Financial Officer      Peter  J. Gombert     Unaffiliated          2.0                                Economics              Hochschule für Wirtschaft und Politik          NaN
227498                  f:999  FinancialOrg       NaN  Neuhaus Partners           NaN  operating  1998-01-01       NaN          DEU        NaN          Hamburg     Hamburg          2007-03-01         2011-11-01                 15                  12              NaN             NaN               0                0.0                NaN               NaN           0              7         p:255377              Communication Manager    Florina  Starzacher     Unaffiliated          3.0  History, Journalism, Psychology, German                  Justus-Liebig-Universität Giessen          NaN
227499                 f:9992  FinancialOrg       NaN     remove_later1           NaN  operating         NaN       NaN          NaN        NaN              NaN     unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1         p:160073                                NaN     Torben        Grue     Dogsuniverse          2.0                                      NaN                                 Aalborg University     1/1/2001
227500                 f:9993  FinancialOrg       NaN     remove_later2           NaN  operating         NaN       NaN          NaN        NaN              NaN     unknown                 NaN                NaN                  0                   0              NaN             NaN               0                0.0                NaN               NaN           0              1         p:160073                                NaN     Torben        Grue     Dogsuniverse          2.0                                      NaN                                 Aalborg University     1/1/2001
227501                 f:9999  FinancialOrg       NaN           CalSTRS           NaN  operating  1913-07-01       NaN          USA         CA  West Sacramento  Sacramento          2012-10-24         2012-10-24                  1                   1              NaN             NaN               0                0.0                NaN               NaN           0              1         p:235504                             Intern       Amit      Tiwari     Unaffiliated          4.0                                  Finance  University of California, Davis - Graduate Sch...     1/1/2005

[227502 rows x 33 columns]

In [240]:
pdrc.to_csv(path+'degrees_complete.csv')
print('Complete')

Complete